In [3]:
import pandas as pd

In [3]:
s1 = pd.read_csv('Data/employees.csv',index_col='First Name', usecols=['First Name','Salary']).squeeze()
s1.head(10)

First Name
Douglas         NaN
Thomas      61933.0
Maria      130590.0
Jerry      138705.0
Larry      101004.0
Dennis     115163.0
Ruby        65476.0
NaN         45906.0
Angela      95570.0
Frances    139852.0
Name: Salary, dtype: float64

In [4]:
len(s1)

1001

In [5]:
s1.count()

np.int64(999)

In [6]:
s1.describe()

count       999.000000
mean      90655.528529
std       32939.511615
min       35013.000000
25%       62560.000000
50%       90427.000000
75%      118744.500000
max      149908.000000
Name: Salary, dtype: float64

In [7]:
s1.sort_values()

First Name
Michael       35013.0
Kevin         35061.0
Steven        35095.0
Matthew       35203.0
Cynthia       35381.0
               ...
Cynthia      149684.0
Rose         149903.0
Katherine    149908.0
Douglas           NaN
NaN               NaN
Name: Salary, Length: 1001, dtype: float64

In [8]:
s1.sort_values(ascending=False)

First Name
Katherine    149908.0
Rose         149903.0
Cynthia      149684.0
NaN          149654.0
Kathy        149563.0
               ...
Steven        35095.0
Kevin         35061.0
Michael       35013.0
Douglas           NaN
NaN               NaN
Name: Salary, Length: 1001, dtype: float64

In [12]:
s1.sort_values(na_position='first')

First Name
Douglas           NaN
NaN               NaN
Michael       35013.0
Kevin         35061.0
Steven        35095.0
               ...
Kathy        149563.0
NaN          149654.0
Cynthia      149684.0
Rose         149903.0
Katherine    149908.0
Name: Salary, Length: 1001, dtype: float64

In [13]:
s1.sort_values(ascending=False,na_position='first')

First Name
Douglas           NaN
NaN               NaN
Katherine    149908.0
Rose         149903.0
Cynthia      149684.0
               ...
Cynthia       35381.0
Matthew       35203.0
Steven        35095.0
Kevin         35061.0
Michael       35013.0
Name: Salary, Length: 1001, dtype: float64

In [14]:
s1.dropna()

First Name
Thomas      61933.0
Maria      130590.0
Jerry      138705.0
Larry      101004.0
Dennis     115163.0
             ...
Henry      132483.0
Phillip     42392.0
Russell     96914.0
Larry       60500.0
Albert     129949.0
Name: Salary, Length: 999, dtype: float64

In [16]:
s1.dropna().sort_values()

First Name
Michael       35013.0
Kevin         35061.0
Steven        35095.0
Matthew       35203.0
Cynthia       35381.0
               ...
Kathy        149563.0
NaN          149654.0
Cynthia      149684.0
Rose         149903.0
Katherine    149908.0
Name: Salary, Length: 999, dtype: float64

In [17]:
s1.sort_index()

First Name
Aaron     61602.0
Aaron     58755.0
Aaron     52119.0
Aaron     63126.0
Adam      95327.0
           ...
NaN       95866.0
NaN      133472.0
NaN      107351.0
NaN      143638.0
NaN           NaN
Name: Salary, Length: 1001, dtype: float64

In [18]:
s1.sort_index().head(10)

First Name
Aaron     61602.0
Aaron     58755.0
Aaron     52119.0
Aaron     63126.0
Adam      95327.0
Adam     110194.0
Adam      71276.0
Adam      45181.0
Alan     111786.0
Alan      40341.0
Name: Salary, dtype: float64

In [20]:
s1.nlargest(3)

First Name
Katherine    149908.0
Rose         149903.0
Cynthia      149684.0
Name: Salary, dtype: float64

In [21]:
s1.nsmallest(10)

First Name
Michael      35013.0
Kevin        35061.0
Steven       35095.0
Matthew      35203.0
Cynthia      35381.0
Christina    35477.0
Kathleen     35575.0
Terry        35633.0
Bruce        35802.0
Frances      35884.0
Name: Salary, dtype: float64

In [22]:
s1.nsmallest(10).describe()

count       10.000000
mean     35412.400000
std        313.058461
min      35013.000000
25%      35122.000000
50%      35429.000000
75%      35618.500000
max      35884.000000
Name: Salary, dtype: float64

In [23]:
s1.nlargest(10).describe()

count        10.000000
mean     149405.600000
std         401.444115
min      148857.000000
25%      149015.000000
50%      149509.500000
75%      149676.500000
max      149908.000000
Name: Salary, dtype: float64